[{"Words": "Certified Public Accountant (CPA)", "Description": "An individual who has met certain criteria and is thus allowed to perform audits of corporations. "}, {"Words": "Revenue Recognition Principle ", "Description": "The principle that companies recognize revenue in the accounting periodic which the performance obligation is a satisfied."}, {"Words": "Treasurer ", "Description": "Employee responsible for the management of a company’s cash. "}, {"Words": "International Financial Reporting Standards (IFRS)", "Description": "Accounting Standards, issued by the IASB, that have been adopted by many countries outside of the U.S."}, {"Words": "Liquidity Ratio", "Description": "Measures of the short-term ability of the company to pay its maturing obligations and to meet unexpected need for cash"}, {"Words": "Stockholder’s Equity ", "Description": "The owners claim to assets."}, {"Words": "Unearned Revenues ", "Description": "Cash received  and a liability recorded before  services are performed."}, {"Words": "Annual Report ", "Description": "A report prepared by corporate management that presents financial information including financial statements, a management discussion and analysis section, notes, and an independent auditors’ report."}, {"Words": "Periodicity Assumption", "Description": "Assumptions that the life of business can be divided into artificial time periods and that useful reports covering those periods can be prepared for the business."}, {"Words": "Free Cash Flow", "Description": "Net cash provided by operating activities after adjusting for capital expenditure and cash dividends paid."}, {"Words": "Gross Profit", "Description": "The excess of net sales over the cost of goods sold."}, {"Words": "Accrued Revenue ", "Description": "Revenues for services performed but not yet received in cash or record."}, {"Words": "Classified Balance Sheet", "Description": "A balance sheet that groups together similar assets and similar liabilities, using a number of standard classification and sections."}, {"Words": "Ratio Analysis ", "Description": "A technique that expresses the relationship among selected items of financial statement data."}, {"Words": "Working Capital ", "Description": "The Difference between the amounts of current asset and current liabilities. "}, {"Words": "Perpetual Inventory System ", "Description": "A detailed inventory system in which a company maintains the cost of each inventory item, and the records continuously show to inventory that should be on hand."}, {"Words": "Common Stock ", "Description": "Term used to describe the total amount paid in by stockholders for the shares they purchase."}, {"Words": "Fraud", "Description": "A dishonest act by an employee that results in personal benefit to the employee at a cost to the employer."}, {"Words": "Depreciation ", "Description": "The process of allocating the cost of an asset to expense over its useful life."}, {"Words": "Book Value ", "Description": "The difference between the cost of a depreciable assets and its related accumulated depreciation. "}, {"Words": "Retained Earnings Statements ", "Description": "A financial statements that summarizes the amounts and causes of changes in retained earnings for a specific time period."}, {"Words": "Prepaid Expenses (Prepayments)", "Description": "Expenses paid in cash before they are used or consumed."}, {"Words": "Cash Budget", "Description": "A projection of anticipated cash flows, usually over a one to two year period."}, {"Words": "Adjusted Trial Balance ", "Description": "A list of accounts and their balance after all adjustment have been made."}, {"Words": "Liabilities ", "Description": "Amounts owed to creditors in the form of debts other obligations."}, {"Words": "Internal Auditors", "Description": "Company employees who continuously evaluate the effectiveness of the company’s internal control system."}, {"Words": "Earning Per Share (EPS)", "Description": "A measures of the net income earned on each share of common stock; computed as net income minus preferred dividends by the average number of common shares outstanding during the year."}, {"Words": "Assets", "Description": "Resources owned by a business."}, {"Words": "Cash-basis Accounting", "Description": "Accounting basis in which a company records revenue only when it receives cash and an expense only  when it pays cash."}, {"Words": "Accrual-basis Accounting", "Description": "Accounting basis in which companies record in the periods in which the events occur, transactions that change a company’s financial statements, even if cash was not exchanged."}, {"Words": "Expense Recognition Principle (Matching Principle) ", "Description": "The principle that matches expenses with revenues in the period when the company makes efforts to generate those revenues."}, {"Words": "Post-closing Trial Balance ", "Description": "A list of permanent accounts and their balance after a company has journalized and posted closing entries."}, {"Words": "Debit", "Description": "The left side of an account."}, {"Words": "Generally Accepted Accounting Principles (GAAP)", "Description": " A set of accounting standards that have substantial authoritative support, that guide accounting profesionals."}, {"Words": "Quality of Earnings", "Description": "Indicates the level of full and transparent information that a company provides to users of its financial statements."}, {"Words": "Partnership ", "Description": "A business owned by two or more persons associated as partners."}, {"Words": "Dividends", "Description": "Payments of cash from a corporation to its stockholder"}, {"Words": "Securities and Exchange Commission (SEC)", "Description": "The agency of the U.S. government that oversees U.S. financial markets and accounting standard-setting bodies. "}, {"Words": "Lower-of-cost-or-market (LCM)", "Description": "A basis whereby inventory is stated at the lower of either its cost or its market value as determined by current replacement cost."}, {"Words": "Purchase Return", "Description": "A return of gods form the buyer to the seller for cash or credit."}, {"Words": "Monetary Unit Assumptions ", "Description": "An assumption that requires that only those things that can be expressed in money are included in the accounting periods "}, {"Words": "Accounting Transactions ", "Description": "Events that require recording in the financial statements because they affect assets, liabilities, or stockholders’ equity."}, {"Words": "Retained Earnings", "Description": "The amount of net income retained in the corporation"}, {"Words": "Cost Constraint", "Description": "Constraint that weighs the cost that companies will incur to provide the information aginst the benefit that financial statements users will gain from having the information available. "}, {"Words": "Timely", "Description": "Information that is available to decision-makers before it loses its capacity to influence decisions "}, {"Words": "Full Disclosure Principle", "Description": " Accounting principle that  that dictates that companies disclose circumstances and events that make a difference to financial statements users"}, {"Words": "Petty Cash Fund", "Description": "A cash fund used to pay relatively small amounts."}, {"Words": "Sales Revenue", "Description": "Primary source of revenue for a merchandising company."}, {"Words": "Balance Sheet", "Description": "A financial statement that reports the assets and claims to those assets at specific point in time "}, {"Words": "Current Liabilities ", "Description": "Obligations that a company excepts to pay within the next year or operating cycle, whichever is longer."}, {"Words": "International Accounting Standards Board (IASB)", "Description": "An accounting standard-setting body that issued standards adopted by many countries outside of the U.S."}, {"Words": "Operating Cycle ", "Description": "The average time required to purchase inventory, sell it on account, and the collect cash from customers - that is ,go form cash to cash."}, {"Words": "Consigned Goods", "Description": "Goods held for sale by one party although ownership of the goods is retained by another paarty."}, {"Words": "Property, Plant and Equipment (PPE)", "Description": "Assets with relatively long useful lives that are currently used in operating in the business. "}, {"Words": "Accounting ", "Description": "The Information System that identifies, records, and communicates the economic events of an organization to interested users."}, {"Words": "Faithful Representation", "Description": "Information that is complete, neutral, and free form error."}, {"Words": "Cost of Goods Sold", "Description": "The total cost of merchandise sold during the period. "}, {"Words": "Quality of Earnings Ratio", "Description": "A measure used to indicate the extent to which a company’s earnings provide a full and transparent depiction of its performance; computed as net cash provide by operating activities divided by net income."}, {"Words": "General Journey", "Description": "The most basic form of journal."}, {"Words": "Comparability ", "Description": "Ability to compare the accounting information of different companies because they use the same accounting principles."}, {"Words": "Current Replacement Cost", "Description": "The cost of purchasing the same goods at the presents time from the usual suppliers in the usual quantities. "}, {"Words": "Temporary Accounts", "Description": "Revenue, expenses, and dividend accounts whose balance a company transfers to Retained Earnings at the end of an accounting period."}, {"Words": "Average-cost Method", "Description": " An inventory costing method that uses the weighted-average unit cost to allocate the cost of goods available for sale to ending inventory and cost of goods sold. "}, {"Words": "Permanent Accounts", "Description": "Balance Sheet accounts whose balance are carried forward to the next accounting period."}, {"Words": "Periodicity Assumptions ", "Description": "An assumptions that the economic life of a business can be divided into artificial time periods."}, {"Words": "T-account", "Description": "The basic form of an account."}, {"Words": "Current ratio", "Description": "A measure of liquidty computed as Current assets divided by Current Liabilities "}, {"Words": "Revenue", "Description": "The increase in assets or decrease in liabilities resulting from the sale of goods or the performance of services in the normal course of business."}, {"Words": "Notes to Financial Statements ", "Description": "Notes Clarify information presented in the financial statements and provide additional detail."}, {"Words": "Voucher System", "Description": "A network of approvals by authorized individuals, acting independently, to ensure that all disbursements by check are proper. "}, {"Words": "Historical Cost Principle", "Description": "An accounting principle that states companies should record assets at their cost. "}, {"Words": "Bank Reconciliation", "Description": "The process of comparing the bank’s account balance with the company’s balance, and explaining the difference to make them agree."}, {"Words": "Adjusting Entries", "Description": "Entries made at the end of accounting period to ensure that the revenue recognition and expense recognition principles are followed."}, {"Words": "Credit", "Description": "The right side of an account."}, {"Words": "Periodic Inventory System", "Description": "An inventory system in which a company does not maintain detailed records of goods on hand throughout the period and determines the cost of goods sold only at the end of accounting period."}, {"Words": "Net Sales", "Description": "Sale less sales returns and allowance and sales discounts."}, {"Words": "Purchase Discount", "Description": "A cash discount claimed by a buyer for prompt payment of a balance due."}, {"Words": "Trial Balance", "Description": "A list of accounts and their balances at a given time."}, {"Words": "Closing Entries ", "Description": "Entries at the end of an accounting period transfer the balance of temporary accounts to a permanent stockholders’ equity account, Retained Earnings."}, {"Words": "Work in Process", "Description": "That portion of manufactured inventory that has begun the production process but is not yet complete."}, {"Words": "Electronic Funds Transfer (ETF)", "Description": "A disbursement system that uses wire, telephone or computer to transfer cash from one location to another."}, {"Words": "Useful Life", "Description": "The length of service of a productive asset."}, {"Words": "Journalizing", "Description": " The procedure of entering transaction data in the journal."}, {"Words": "Profitability Ratios", "Description": "Measures of the operating success of a company for a given period of time."}, {"Words": "Specific Identification Method", "Description": "An actual physicals-low costing method in which particular items sold and items still in inventory  are specifically costed to arrive at cost of goods sold and ending inventory. "}, {"Words": "Relevance", "Description": "The quality of information that indicates the information makes a difference in a decision."}, {"Words": "Solvency Ratio", "Description": "Measures of the company to survive over a long period of time. "}, {"Words": "General Ledeger", "Description": "A ledger that contains all assets, liability, stockholders’ equity, revenue or expense accounts."}, {"Words": "Debt to Assets Ratio ", "Description": "A measure of solvency calculated as total liabilities by total Assets. It measures the percentage of total financing provide by creditors."}, {"Words": "Gross Profit Rate", "Description": "Gross profit expressed as a percentage by dividing the amount of gross profit by net sales."}, {"Words": "Net Income ", "Description": "The amount by which revenues exceed expenses."}, {"Words": "Journal", "Description": "An accounting record in which transactions are initially recorded in chronological order."}, {"Words": "FOB Shipping Point ", "Description": "Freight terms indicating that ownership of goods passes to the buyer when the public carrier accepts the goods form the seller."}, {"Words": "Last-in, First-out (LIFO) Method", "Description": "Inventory costing method that assume that the lasts units purchased are the first to be sold."}, {"Words": "Voucher", "Description": "An authorization from prepared for each expenditure in voucher system. "}, {"Words": "Posting", "Description": "The procedure of transferring journal entry amounts to the ledger accounts."}, {"Words": "Cash Equivalents ", "Description": "Short-term, highly liquid investments that can be readily converted to a specific amount of cash and which are relatively insensitive to interest rate changes."}, {"Words": "Ratio", "Description": "An expression of the  mathematical relationship between one quantity and another."}, {"Words": "Materiality ", "Description": "Whether an item is large enough to likely influence the decision of an investor or creditor."}, {"Words": "Earnings Management ", "Description": "The planned timing of revenues, expenses, gains, and losses to smooth out bumps in net income."}, {"Words": "Sales Discount", "Description": "A reduction given by a seller for prompt payment of a credit sale."}, {"Words": "FOB Destination", "Description": "Freight terms indicating that owner ship of goods remains with the seller until the goods reach the buyer."}, {"Words": "Verifiable", "Description": "The quality of information that occurs when independent observers, using the same methods, obtain similar results. "}, {"Words": "Contra Asset Account ", "Description": "An account that is offset against an asset account on the balance sheet."}, {"Words": "Understandability", "Description": "Information presented in a clear concise fashion so that users can interpret it an comprehend its meaning."}, {"Words": "Accounting Information Systems", "Description": "The system of collecting processing transaction data and communicating financial information to decisions-makers ."}, {"Words": "Net Loss", "Description": "The amount by which expenses exceed revenues."}, {"Words": "Auditor’s Report ", "Description": "A report prepared by an independent outside auditor stating the auditor’s opinion as to the fairness of the presentation of the financial position results of and their conformance with generally accepted accounting principles."}, {"Words": "Fair Value Principle ", "Description": "Assets and Liabilities should be reported at fair value (the price received to sell an assets or settle liability)"}, {"Words": "Financial Accounting Standards Board (FASB)", "Description": "The primary accounting standards-setting body in the U.S."}, {"Words": "Deposits in Transit", "Description": "Deposits recorded by the depositor that have not been recorded by the bank."}, {"Words": "Sales Invoice ", "Description": "a document that provides support for each sale."}, {"Words": "Chart of Accounts ", "Description": "A list of a company’s accounts"}, {"Words": "Days in Inventory ", "Description": "Measures of the average number of days inventory  is held; calculated as 365 divided by inventory turnover."}, {"Words": "Purchase Allowance", "Description": "A deduction made to the selling price of merchandise, granted by the seller, so that the buyer will keep the merchandise."}, {"Words": "Sole Proprietorship", "Description": "A business owned by one person."}, {"Words": "Intangible Assets", "Description": "Assets that do not have physical substance."}, {"Words": "Fraud Triangle", "Description": "The three factors that contribute to fraudulent activity by employees opportunity, financial, pressure, and rationalization. "}, {"Words": "Basic Accounting Equation ", "Description": "Assets = Liabilities + Stockholder’s Equity"}, {"Words": "Profits Margin", "Description": "Measures the percentage of each dollar of sales that results in net income, computed by dividing net income by net sales."}, {"Words": "Sales Return and Allowance ", "Description": "Transaction in which the seller either accepts goods back from the purchaser (a returner) or grants a reduction in the purchase price (an allowance) so that the buyer will keep the goods."}, {"Words": "Inventory Turnover", "Description": "A ratio that indicates the liquidity of inventory by measuring the number of times average inventory sold during the period; computed by dividing cost of goods sold by the average inventory during period."}, {"Words": "NSF Checks", "Description": "A check that is not paid by a bank because of insufficient funds in a bank account."}, {"Words": "Current Assets", "Description": "Assets that companies except to convert to cash or use up with one year or operating cycle, whichever is longer."}, {"Words": "Expenses ", "Description": "The cost of assets consumed or services used in the process of generating revenues."}, {"Words": "Public Company Accounting Oversight Board (PCAOB)", "Description": "The group was charged with determining auditing standards and reviewing the performance of auditing firms."}, {"Words": "Reversing Entry", "Description": "An entry made at the beginning of the next accounting period, the  exact opposite of the adjusting entry made in the previous period."}, {"Words": "Cash", "Description": "Resources that consist of coins, currency, checks, money orders, and money on hand or on deposits in a bank or similar depository."}, {"Words": "Finished Goods Inventory", "Description": "Manufactured items that are completed and ready for sale."}, {"Words": "Sarbanes-Oxley Act (SOX)", "Description": "Regulations passed by Congress to reduce unethical corporate behavior."}, {"Words": "Management discussion and analysis (MD&A)", "Description": "A section of the annual report that presents management’s views on the company’s ability to pay near-term obligations, its ability to fund operations and  expansions, and its results of operations."}, {"Words": "Long-term Liabilities (long-term debt)", "Description": "Obligations that  a company excepts to pay after one year."}, {"Words": "Restricted Cash ", "Description": "Cash that is not available for general use but instead is restricted for a particular purpose."}, {"Words": "Going Concern Assumption ", "Description": "The assumption that the company will continue in operation for the foreseeable future."}, {"Words": "Account ", "Description": "Accounting record of increases and decreases in specific assets, liability, stockholders’ equity, revenue or expenses items. "}, {"Words": "Worksheet ", "Description": "A multiple-column from that companies may use in the adjustment process and in preparing financial statements."}, {"Words": "Double-Entry System", "Description": "A system records the two-sided effect of each transaction in appropriate accounts."}, {"Words": "Ledger", "Description": "The group of accounts maintained by a company."}, {"Words": "Income Summary", "Description": "A temporary account used in closing revenue and expense accounts."}, {"Words": "Purchase Invoice", "Description": "A document that provides support for each purchase."}, {"Words": "Raw Materials ", "Description": "Basic goods that will be used in production but have not yet been placed in production."}, {"Words": "Consistency", "Description": "Use of the same accounting principles and methods from year to year within a company"}, {"Words": "Liquidity ", "Description": "The ability of a company to pay obligations that are expected to become due within the next year or operating cycle"}, {"Words": "Outstanding Checks", "Description": "Checks issued and recorded by a company that have not been paid by the bank"}, {"Words": "Fiscal Year", "Description": "An accounting period that is one year long."}, {"Words": "Economic Entity Assumption", "Description": "An assumption that every economic entity can be separately identified and accounted for."}, {"Words": "Bank Statement ", "Description": "A statement received monthly form the bank that shows the deposits bank transactions and balances."}, {"Words": "LIFO Reserves ", "Description": "For a company using LIFO, the difference between inventory reported using LIFO and inventory using FIFO."}, {"Words": "Statement of Cash Flows", "Description": "A financial statements that provides financial information about the cash receipts and cash payments of as business for a specific period of time."}, {"Words": "Long-Term Investments", "Description": "Generally, (1) investments in stocks and bonds of other corporations that companies hold for more than one year, (2) long-term assets, such as land and buildings, not currently being used in the company’s operations; and (3) long-term notes receivable."}, {"Words": "Internal Control", "Description": "All the related methods and measures adopted within an organization to safeguard assets and enhance the reliability of accounting records, increase efficiency of operations, and ensure compliance with laws and regulations."}, {"Words": "First in - First out (FIFO) Method", "Description": "An inventory costing methods that assumes that the earliest goods purchased are the first to be sold."}, {"Words": "Just-in-time (JIT) Inventory ", "Description": "Inventory system in which companies manufacture of purchase goods just in time for use."}, {"Words": "Bonding ", "Description": "Obtaining insurance protection against theft by employee "}, {"Words": "Income Statement ", "Description": "A Financial statement that reports a company’s revenues and expenses and resulting net income or net loss for a specific period of time."}, {"Words": "Weighted-average Unit Cost", "Description": "Average cost that is weighted by the number of units purchased at each unit cost. "}, {"Words": "Accrued Expenses", "Description": "Expenses incurred but not yet paid cash or record."}, {"Words": "Contra Revenue Account", "Description": "An account that is offset against a revenue account on the income statements."}, {"Words": "Statements of Stockholders Equity ", "Description": "A financial statement that presents the causes of changes to stockholders’ equity during the period, including those that caused retained earnings. "}, {"Words": "Solvency ", "Description": "The ability of the company to pay interest as it comes due and to repay the balance of debt due at its maturity. "}]